## Pandas aggregation and Pivot Tables

In [10]:
# import 

import pandas as pd 
import  numpy as np

### Data loading

In [11]:
# Data loading
df_titanic =  pd.read_csv("./data/titanic.csv")
df_titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1.0,0.0,3,"Braund, Mr. Owen Harris",male,22.0,1.0,0.0,A/5 21171,7.2500,NaN,S
1,2.0,1.0,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1.0,0.0,PC 17599,71.2833,C85,C
2,3.0,1.0,3,"Heikkinen, Miss. Laina",female,26.0,0.0,0.0,STON/O2. 3101282,7.9250,NaN,S
3,4.0,1.0,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1.0,0.0,113803,53.1000,C123,S
4,5.0,0.0,3,"Allen, Mr. William Henry",male,35.0,0.0,0.0,373450,8.0500,NaN,S

### Data Cleaning

In [12]:
df_titanic = df_titanic.drop('Cabin', axis =1)

In [13]:
# remove duplicates
df_titanic = df_titanic.drop_duplicates()

In [14]:
# remove null values 
df_titanic = df_titanic.dropna()

In [15]:
df_titanic.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1007 entries, 0 to 1390
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  1007 non-null   float64
 1   Survived     1007 non-null   float64
 2   Pclass       1007 non-null   object
 3   Name         1007 non-null   object
 4   Sex          1007 non-null   object
 5   Age          1007 non-null   float64
 6   SibSp        1007 non-null   float64
 7   Parch        1007 non-null   float64
 8   Ticket       1007 non-null   object
 9   Fare         1007 non-null   float64
 10  Embarked     1007 non-null   object
dtypes: float64(6), object(5)
memory usage: 94.4+ KB

### Group_by

In [16]:
# Groupby "sex" and find the average Fare For Each Sex
df_titanic.groupby("Sex")["Fare"].mean()

Sex
female    43.683847
male      30.927626
Name: Fare, dtype: float64

In [17]:
df_titanic["Sex"].value_counts()

male      609
female    398
Name: Sex, dtype: int64

In [18]:
# Groupby "sex" "Pclass" and get the agg
df_titanic.groupby(["Sex","Pclass"])["Fare"].agg(["min","max","mean","count"])

                  min       max       mean  count
Sex    Pclass
female 1       6.4375  512.3292  86.670048    106
       2       4.0125  221.7792  25.676072    105
       3       4.0125  262.3750  20.737562    139
       ?       7.1250  227.5250  54.596615     48
male   1       0.0000  512.3292  61.852686    138
       2       5.0000  135.6333  26.739043    135
       3       0.0000  512.3292  17.348280    274
       ?       0.0000  247.5208  31.226682     62

### Pivot Tables

The pivot() function in pandas is used to create a pivot table from a DataFrame. It allows you to summarize and aggregate data in a very flexible way.

```python

DataFrame.pivot(
    index=None,
    columns=None, 
    values=None)

```


Parameters:

    index: column or array-like — Column(s) to use as the new index.
    columns: column or array-like — Column(s) to use as the new columns.
    values: column or array-like — The column(s) to use for the values in the new DataFrame.

### Pivot Table

pivot table to count the number of passegers per class

In [19]:
df_titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,1.0,0.0,3,"Braund, Mr. Owen Harris",male,22.0,1.0,0.0,A/5 21171,7.2500,S
1,2.0,1.0,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1.0,0.0,PC 17599,71.2833,C
2,3.0,1.0,3,"Heikkinen, Miss. Laina",female,26.0,0.0,0.0,STON/O2. 3101282,7.9250,S
3,4.0,1.0,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1.0,0.0,113803,53.1000,S
4,5.0,0.0,3,"Allen, Mr. William Henry",male,35.0,0.0,0.0,373450,8.0500,S

In [20]:
# pivot table
df_titanic.pivot(columns="Sex",values=["Age","Fare"]).mean()

      Sex
Age   female    28.513643
      male      31.171461
Fare  female    43.683847
      male      30.927626
dtype: float64

#### Pivoting Titanic Data to Show Average Age for Each Survival Group

In [21]:
# a pivot table on "Survived"
df_titanic.pivot(columns="Survived",values="Age").mean()

Survived
0.0    30.790976
1.0    29.196028
dtype: float64

In [22]:
df_titanic.pivot(columns="Survived")["Age"].mean()

Survived
0.0    30.790976
1.0    29.196028
dtype: float64

### Pivot table with aggregate functions

Common Aggregation Functions in Pandas:

    Sum (sum): Adds up all the values in a column or group.
    Mean (mean): Computes the average of the values in a column or group.
    Count (count): Counts the number of non-NA/null entries in a column or group.
    Minimum (min): Finds the smallest value in a column or group.
    Maximum (max): Finds the largest value in a column or group.
    Standard Deviation (std): Computes the standard deviation of the values in a column or group.
    Variance (var): Computes the variance of the values in a column or group.
    Median (median): Finds the middle value in a column or group.
    First (first): Returns the first value in a column or group.
    Last (last): Returns the last value in a column or group.

In [23]:
# pivot with aggregate functions 
df_titanic.pivot(columns="Survived",values="Age").agg(["min","max","mean","count"])

              0.0         1.0
min      0.420000    0.420000
max     74.000000   80.000000
mean    30.790976   29.196028
count  584.000000  423.000000

### Multiple Columns

In [24]:
# pivoting on multiple columns 
df_titanic.pivot(columns=["Sex","Pclass"],values=["Fare"]).agg(["min","max","mean","count"])

            Fare                                                              \
            male      female                    male      female        male
               3           1           3           1           2           2
min      0.00000    6.437500    4.012500    0.000000    4.012500    5.000000
max    512.32920  512.329200  262.375000  512.329200  221.779200  135.633300
mean    17.34828   86.670048   20.737562   61.852686   25.676072   26.739043
count  274.00000  106.000000  139.000000  138.000000  105.000000  135.000000


           female        male
                ?           ?
min      7.125000    0.000000
max    227.525000  247.520800
mean    54.596615   31.226682
count   48.000000   62.000000